### Merge entre 3 dataframe

In [1]:
import pandas as pd

In [2]:
dfPed = pd.read_csv("../ficheros_curso/merge/Pedidos.txt", sep=";")
dfEmpr = pd.read_csv("../ficheros_curso/merge/Empresas.txt", sep=";")
dfEmp = pd.read_csv("../ficheros_curso/merge/Empleados.txt", sep=";")

In [3]:
dfPed.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [4]:
dfEmpr.head()

   id           empresa
0   1    Speedy Express
1   2    United Package
2   3  Federal Shipping

In [5]:
dfEmp.head()

   id     nombre                     cargo
0   1    Davolio   Representante de ventas
1   2     Fuller  Vicepresidente comercial
2   3  Leverling   Representante de ventas
3   4    Peacock   Representante de ventas
4   5   Buchanan         Gerente de ventas

In [6]:
dfTotal = pd.merge(dfPed, dfEmp, left_on="idempleado", right_on="id")
dfTotal.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,id,nombre,cargo
0,10248,WILMK,5,3,32.38,Finlandia,5,Buchanan,Gerente de ventas
1,10249,TOMSP,6,1,11.61,Alemania,6,Suyama,Representante de ventas
2,10250,HANAR,4,2,65.83,Brasil,4,Peacock,Representante de ventas
3,10251,VICTE,3,1,41.34,Francia,3,Leverling,Representante de ventas
4,10252,SUPRD,4,2,51.30,Belgica,4,Peacock,Representante de ventas

In [7]:
dfTotal = dfTotal.merge(dfEmpr, left_on='idempresa', right_on='id')
dfTotal.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,id_x,nombre,cargo,id_y,empresa
0,10248,WILMK,5,3,32.38,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
1,10249,TOMSP,6,1,11.61,Alemania,6,Suyama,Representante de ventas,1,Speedy Express
2,10250,HANAR,4,2,65.83,Brasil,4,Peacock,Representante de ventas,2,United Package
3,10251,VICTE,3,1,41.34,Francia,3,Leverling,Representante de ventas,1,Speedy Express
4,10252,SUPRD,4,2,51.30,Belgica,4,Peacock,Representante de ventas,2,United Package

In [8]:
dfTotal.rename(columns={"nombre":"empleado"}, inplace=True)
dfTotal=dfTotal[['idpedido','cliente','empleado','empresa','importe','pais']]
dfTotal.head()

   idpedido cliente   empleado           empresa  importe       pais
0     10248   WILMK   Buchanan  Federal Shipping    32.38  Finlandia
1     10249   TOMSP     Suyama    Speedy Express    11.61   Alemania
2     10250   HANAR    Peacock    United Package    65.83     Brasil
3     10251   VICTE  Leverling    Speedy Express    41.34    Francia
4     10252   SUPRD    Peacock    United Package    51.30    Belgica

In [10]:
dfTotal.to_json("../ficheros/pedidos.json", orient='records', indent=4)

In [14]:
grupo = dfTotal.importe.groupby([dfTotal.empresa,dfTotal.empleado])
grupo.sum()
print(type(grupo))

<class 'pandas.core.groupby.generic.SeriesGroupBy'>